cowkim937/ESP32_Inference/ESP32_DSCNN.c
#include "ESP32_DSCNN.h"

int debug_mode = __TEST_OFF__;

int max_value;
int ans_index;

int con[DSCNN_CLASS];

char class_label[17][64]={
	"Straight",
	"Left Curve",
	"Right Curve",
	"Left Turn",
	"Right Turn",
	"Left Change Lane",
	"Right Change Lane",
	"Stop",
	"U-Turn",
	"Sudden Left Turn",
	"Sudden Right Turn",
	"Sudden Left Change Lane",
	"Sudden Right Change Lane",
	"Weaving",
	"Left Jerking",
	"Right Jerking",
	"Sudden U-Turn"
};

int input_test = 0;

dl_matrix3dq_t *input_matrix3dq = NULL;
dl_matrix3dq_t *filter_matrix3dq = NULL;
dl_matrix3dq_t *buffer_matrix3dq = NULL;
dl_matrix3dq_t *bias_matrix3dq = NULL;
dl_matrix3dq_t *output_matrix3dq = NULL;

void DSCNN_init(){
    memset(con, 0, sizeof(int) * DSCNN_CLASS);
}

void setinput(int inputs){
    input_test = inputs;
}

int dangerous_DLmodel8(int16_t *nor_data_inputs, driver_behaivor driver_data){
    char *debug_mode = NULL;
    
    int windowsize = driver_data.window_size;
    int sensors = driver_data.sensors;
    int padding = 2;
    int strider = 0;

    // long long timer = esp_timer_get_time();

    // input
	input_matrix3dq = dl_matrix3dq_alloc(1, (sensors + padding), (windowsize + padding), 1, STATIC_EXPONENT);
	memset(input_matrix3dq->item, 0, sizeof(qtp_t) * (sensors + padding) * (windowsize + padding));

    for(int inp=0; inp < windowsize; inp++){
        memcpy(input_matrix3dq->item + ((inp + 1) * (sensors + padding) + 1),
              nor_data_inputs + (inp * sensors),
              sizeof(qtp_t) * sensors);
        // ESP_LOGI("INPUTDATA","%3d %3d", inp, nor_data_inputs[inp]);
    }
	
    debug_logi("dl_input", input_matrix3dq);


    // Input check log independent code
    int plog = 0;
    char logiout[1024] = {0, };

    for (int hlog = 0; hlog < input_matrix3dq->h; hlog++) {
        memset(logiout, 0, sizeof(char) * 1024);
        sprintf(logiout, "%3d %15s ", hlog, "NorInput");
        for (int wlog = 0; wlog < input_matrix3dq->w; wlog++) {
            sprintf(logiout, "%s %6d ", logiout, *(input_matrix3dq->item + plog + (wlog * input_matrix3dq->c)));
        }
        plog += (input_matrix3dq->w * input_matrix3dq->c);
        ESP_LOGI("INPUT", "%s", logiout);
    }


    // conv1
	filter_matrix3dq = dl_matrix3dq_alloc(conv_1_weights_0.n,
                                          conv_1_weights_0.w,
                                          conv_1_weights_0.h,
                                          conv_1_weights_0.c,
                                          conv_1_weights_0.exponent);

	memcpy(filter_matrix3dq->item,
            &conv_1_weights_0_item_array,
            sizeof(conv_1_weights_0_item_array));

	buffer_matrix3dq = dl_matrix3dq_alloc(conv_1_biases_0.n,
                                          conv_1_biases_0.w,
                                          conv_1_biases_0.h,
                                          conv_1_biases_0.c,
                                          conv_1_biases_0.exponent);

	bias_matrix3dq = dl_matrix3dq_alloc(conv_1_biases_0.n,
                                        conv_1_biases_0.w,
                                        conv_1_biases_0.h,
                                        conv_1_biases_0.c,
                                        STATIC_EXPONENT);
                                        
	memcpy(buffer_matrix3dq->item,
            &conv_1_biases_0_item_array,
            sizeof(conv_1_biases_0_item_array));

    dl_matrix3dq_shift_exponent(bias_matrix3dq, buffer_matrix3dq, STATIC_EXPONENT);
    dl_matrix3dq_free(buffer_matrix3dq);
    
	output_matrix3dq = dl_matrix3dqq_conv_3x3_with_bias_relu(input_matrix3dq,
                                                            filter_matrix3dq,
                                                            bias_matrix3dq,
                                                            dscnn_model_info[strider][0],
                                                            dscnn_model_info[strider][1],
                                                            PADDING_VALID,
                                                            STATIC_EXPONENT,
                                                            debug_mode);

    windowsize = stride_reshaper(windowsize, 0, strider);
    sensors = stride_reshaper(sensors, 0, strider);
    strider++;

	dl_matrix3dq_free(input_matrix3dq);
	dl_matrix3dq_free(filter_matrix3dq);
	dl_matrix3dq_free(bias_matrix3dq);

    debug_logi("conv1_out", output_matrix3dq);

	// conv2_ds
	input_matrix3dq = dl_matrix3dq_alloc(conv_ds_1_dw_conv_depthwise_weights_0.n,
                                        (sensors + padding),
                                        (windowsize + padding),
                                        conv_ds_1_dw_conv_depthwise_weights_0.c,
                                        STATIC_EXPONENT);

	memset(input_matrix3dq->item,
            0,
            sizeof(qtp_t) *
            (sensors + padding) *
            (windowsize + padding) *
            conv_ds_1_dw_conv_depthwise_weights_0.c);

    for(int inp=0; inp < windowsize; inp++)
       memcpy(input_matrix3dq->item + (inp * (sensors + padding) * conv_ds_1_dw_conv_depthwise_weights_0.c),
              output_matrix3dq->item + (inp * sensors * conv_ds_1_dw_conv_depthwise_weights_0.c),
              sizeof(qtp_t) * sensors * conv_ds_1_dw_conv_depthwise_weights_0.c);
    
    debug_logi("conv2_dw_in", output_matrix3dq);

	dl_matrix3dq_free(output_matrix3dq);

	filter_matrix3dq = dl_matrix3dq_alloc(conv_ds_1_dw_conv_depthwise_weights_0.n,
                                          conv_ds_1_dw_conv_depthwise_weights_0.w,
                                          conv_ds_1_dw_conv_depthwise_weights_0.h,
                                          conv_ds_1_dw_conv_depthwise_weights_0.c,
                                          conv_ds_1_dw_conv_depthwise_weights_0.exponent);

	memcpy(filter_matrix3dq->item,
            &conv_ds_1_dw_conv_depthwise_weights_0_item_array,
            sizeof(conv_ds_1_dw_conv_depthwise_weights_0_item_array));

    buffer_matrix3dq = dl_matrix3dq_alloc(conv_ds_1_dw_conv_biases_0.n,
                                          conv_ds_1_dw_conv_biases_0.w,
                                          conv_ds_1_dw_conv_biases_0.h,
                                          conv_ds_1_dw_conv_biases_0.c,
                                          conv_ds_1_dw_conv_biases_0.exponent);

	bias_matrix3dq = dl_matrix3dq_alloc(conv_ds_1_dw_conv_biases_0.n,
                                        conv_ds_1_dw_conv_biases_0.w,
                                        conv_ds_1_dw_conv_biases_0.h,
                                        conv_ds_1_dw_conv_biases_0.c,
                                        STATIC_EXPONENT);
                                        
	memcpy(buffer_matrix3dq->item,
            &conv_ds_1_dw_conv_biases_0_item_array,
            sizeof(conv_ds_1_dw_conv_biases_0_item_array));
    
    dl_matrix3dq_shift_exponent(bias_matrix3dq, buffer_matrix3dq, STATIC_EXPONENT);
    dl_matrix3dq_free(buffer_matrix3dq);
    
