cowkim937/ESP32_Inference/ESP32_DSCNN.c
	output_matrix3dq = dl_matrix3dqq_depthwise_conv_3x3_with_bias(input_matrix3dq,
                                                                filter_matrix3dq,
                                                                bias_matrix3dq,
                                                                dscnn_model_info[strider][0],
                                                                dscnn_model_info[strider][1],
                                                                PADDING_VALID,
                                                                STATIC_EXPONENT,
                                                                ReLuSTATE,
                                                                debug_mode);

    windowsize = stride_reshaper(windowsize, 0, strider);
    sensors = stride_reshaper(sensors, 0, strider);
    strider++;

	dl_matrix3dq_free(input_matrix3dq);
	dl_matrix3dq_free(filter_matrix3dq);
	dl_matrix3dq_free(bias_matrix3dq);

    debug_logi("conv4_dw_out", output_matrix3dq);

	// conv4_pw
	input_matrix3dq = output_matrix3dq;

	filter_matrix3dq = dl_matrix3dq_alloc(conv_ds_3_pw_conv_weights_0.n,
                                          conv_ds_3_pw_conv_weights_0.w,
                                          conv_ds_3_pw_conv_weights_0.h,
                                          conv_ds_3_pw_conv_weights_0.c,
                                          conv_ds_3_pw_conv_weights_0.exponent);

	memcpy(filter_matrix3dq->item,
            &conv_ds_3_pw_conv_weights_0_item_array,
            sizeof(conv_ds_3_pw_conv_weights_0_item_array));

    buffer_matrix3dq = dl_matrix3dq_alloc(conv_ds_3_pw_conv_biases_0.n,
                                          conv_ds_3_pw_conv_biases_0.w,
                                          conv_ds_3_pw_conv_biases_0.h,
                                          conv_ds_3_pw_conv_biases_0.c,
                                          conv_ds_3_pw_conv_biases_0.exponent);

	bias_matrix3dq = dl_matrix3dq_alloc(conv_ds_3_pw_conv_biases_0.n,
                                        conv_ds_3_pw_conv_biases_0.w,
                                        conv_ds_3_pw_conv_biases_0.h,
                                        conv_ds_3_pw_conv_biases_0.c,
                                        STATIC_EXPONENT);
                                        
	memcpy(buffer_matrix3dq->item,
            &conv_ds_3_pw_conv_biases_0_item_array,
            sizeof(conv_ds_3_pw_conv_biases_0_item_array));

    dl_matrix3dq_shift_exponent(bias_matrix3dq, buffer_matrix3dq, STATIC_EXPONENT);
    dl_matrix3dq_free(buffer_matrix3dq);

	output_matrix3dq = dl_matrix3dq_alloc(conv_ds_3_pw_conv_biases_0.n,
                                        sensors,
                                        windowsize,
                                        conv_ds_3_pw_conv_biases_0.c,
                                        STATIC_EXPONENT);

	dl_matrix3dqq_conv_1x1_with_bias_relu(output_matrix3dq,
                                            input_matrix3dq,
                                            filter_matrix3dq,
                                            bias_matrix3dq,
                                            DL_XTENSA_IMPL,
                                            debug_mode);

	dl_matrix3dq_free(input_matrix3dq);
	dl_matrix3dq_free(filter_matrix3dq);
	dl_matrix3dq_free(bias_matrix3dq);

    debug_logi("conv4_pw_out", output_matrix3dq);

	// conv5_ds
	input_matrix3dq = dl_matrix3dq_alloc(conv_ds_4_dw_conv_depthwise_weights_0.n,
                                        (sensors + padding),
                                        (windowsize + padding),
                                        conv_ds_4_dw_conv_depthwise_weights_0.c,
                                        STATIC_EXPONENT);

	memset(input_matrix3dq->item,
            0,
            sizeof(qtp_t) *
            (sensors + padding) *
            (windowsize + padding) *
            conv_ds_4_dw_conv_depthwise_weights_0.c);

    for(int inp=0; inp < windowsize; inp++){
        memcpy(input_matrix3dq->item + ((inp + 1) * (sensors + padding) * conv_ds_4_dw_conv_depthwise_weights_0.c + conv_ds_4_dw_conv_depthwise_weights_0.c),
              output_matrix3dq->item + (inp * sensors * conv_ds_4_dw_conv_depthwise_weights_0.c),
              sizeof(qtp_t) * sensors * conv_ds_4_dw_conv_depthwise_weights_0.c);
    }

    debug_logi("conv5_dw_in", input_matrix3dq);

	dl_matrix3dq_free(output_matrix3dq);

	filter_matrix3dq = dl_matrix3dq_alloc(conv_ds_4_dw_conv_depthwise_weights_0.n,
                                          conv_ds_4_dw_conv_depthwise_weights_0.w,
                                          conv_ds_4_dw_conv_depthwise_weights_0.h,
                                          conv_ds_4_dw_conv_depthwise_weights_0.c,
                                          conv_ds_4_dw_conv_depthwise_weights_0.exponent);

	memcpy(filter_matrix3dq->item,
            &conv_ds_4_dw_conv_depthwise_weights_0_item_array,
            sizeof(conv_ds_4_dw_conv_depthwise_weights_0_item_array));

    buffer_matrix3dq = dl_matrix3dq_alloc(conv_ds_4_dw_conv_biases_0.n,
                                          conv_ds_4_dw_conv_biases_0.w,
                                          conv_ds_4_dw_conv_biases_0.h,
                                          conv_ds_4_dw_conv_biases_0.c,
                                          conv_ds_4_dw_conv_biases_0.exponent);

	bias_matrix3dq = dl_matrix3dq_alloc(conv_ds_4_dw_conv_biases_0.n,
                                        conv_ds_4_dw_conv_biases_0.w,
                                        conv_ds_4_dw_conv_biases_0.h,
                                        conv_ds_4_dw_conv_biases_0.c,
                                        STATIC_EXPONENT);
                                        
	memcpy(buffer_matrix3dq->item,
            &conv_ds_4_dw_conv_biases_0_item_array,
            sizeof(conv_ds_4_dw_conv_biases_0_item_array));
    
    dl_matrix3dq_shift_exponent(bias_matrix3dq, buffer_matrix3dq, STATIC_EXPONENT);
    dl_matrix3dq_free(buffer_matrix3dq);

