cowkim937/ESP32_Inference/ESP32_DSCNN.c
	output_matrix3dq = dl_matrix3dqq_depthwise_conv_3x3_with_bias(input_matrix3dq,
                                                                filter_matrix3dq,
                                                                bias_matrix3dq,
                                                                dscnn_model_info[strider][0],
                                                                dscnn_model_info[strider][1],
                                                                PADDING_VALID,
                                                                STATIC_EXPONENT,
                                                                ReLuSTATE,
                                                                debug_mode);

    windowsize = stride_reshaper(windowsize, 0, strider);
    sensors = stride_reshaper(sensors, 0, strider);
    strider++;

	dl_matrix3dq_free(input_matrix3dq);
	dl_matrix3dq_free(filter_matrix3dq);
	dl_matrix3dq_free(bias_matrix3dq);

    debug_logi("conv5_dw_out", output_matrix3dq);

	// conv5_pw
	input_matrix3dq = output_matrix3dq;

	filter_matrix3dq = dl_matrix3dq_alloc(conv_ds_4_pw_conv_weights_0.n,
                                          conv_ds_4_pw_conv_weights_0.w,
                                          conv_ds_4_pw_conv_weights_0.h,
                                          conv_ds_4_pw_conv_weights_0.c,
                                          conv_ds_4_pw_conv_weights_0.exponent);

	memcpy(filter_matrix3dq->item,
            &conv_ds_4_pw_conv_weights_0_item_array,
            sizeof(conv_ds_4_pw_conv_weights_0_item_array));

    buffer_matrix3dq = dl_matrix3dq_alloc(conv_ds_4_pw_conv_biases_0.n,
                                          conv_ds_4_pw_conv_biases_0.w,
                                          conv_ds_4_pw_conv_biases_0.h,
                                          conv_ds_4_pw_conv_biases_0.c,
                                          conv_ds_4_pw_conv_biases_0.exponent);

	bias_matrix3dq = dl_matrix3dq_alloc(conv_ds_4_pw_conv_biases_0.n,
                                        conv_ds_4_pw_conv_biases_0.w,
                                        conv_ds_4_pw_conv_biases_0.h,
                                        conv_ds_4_pw_conv_biases_0.c,
                                        STATIC_EXPONENT);
                                        
	memcpy(buffer_matrix3dq->item,
            &conv_ds_4_pw_conv_biases_0_item_array,
            sizeof(conv_ds_4_pw_conv_biases_0_item_array));
    
    dl_matrix3dq_shift_exponent(bias_matrix3dq, buffer_matrix3dq, STATIC_EXPONENT);
    dl_matrix3dq_free(buffer_matrix3dq);

	output_matrix3dq = dl_matrix3dq_alloc(conv_ds_4_pw_conv_biases_0.n,
                                        sensors,
                                        windowsize,
                                        conv_ds_4_pw_conv_biases_0.c,
                                        STATIC_EXPONENT);

	dl_matrix3dqq_conv_1x1_with_bias_relu(output_matrix3dq,
                                            input_matrix3dq,
                                            filter_matrix3dq,
                                            bias_matrix3dq,
                                            DL_XTENSA_IMPL,
                                            debug_mode);

	dl_matrix3dq_free(input_matrix3dq);
	dl_matrix3dq_free(filter_matrix3dq);
	dl_matrix3dq_free(bias_matrix3dq);

    debug_logi("conv5_pw_out", output_matrix3dq);

	// global pool
	input_matrix3dq = dl_matrix3dq_global_pool(output_matrix3dq);
	dl_matrix3dq_free(output_matrix3dq);

    debug_logi("GPooling", input_matrix3dq);

	// fc
	filter_matrix3dq = dl_matrix3dq_alloc(fc1_weights_0.w,
                                          fc1_weights_0.n,
                                          fc1_weights_0.c,
                                          fc1_weights_0.h,
                                          fc1_weights_0.exponent);

	memcpy(filter_matrix3dq->item,
            &fc1_weights_0_item_array,
            sizeof(fc1_weights_0_item_array));

    buffer_matrix3dq = dl_matrix3dq_alloc(fc1_biases_0.n,
                                          fc1_biases_0.w,
                                          fc1_biases_0.h,
                                          fc1_biases_0.c,
                                          fc1_biases_0.exponent);

	bias_matrix3dq = dl_matrix3dq_alloc(fc1_biases_0.n,
                                        fc1_biases_0.w,
                                        fc1_biases_0.h,
                                        fc1_biases_0.c,
                                        STATIC_EXPONENT);
                                        
	memcpy(buffer_matrix3dq->item,
            &fc1_biases_0_item_array,
            sizeof(fc1_biases_0_item_array));

    dl_matrix3dq_shift_exponent(bias_matrix3dq, buffer_matrix3dq, STATIC_EXPONENT);
    dl_matrix3dq_free(buffer_matrix3dq);

	output_matrix3dq = dl_matrix3dq_alloc(fc1_biases_0.n,
                                          fc1_biases_0.w,
                                          fc1_biases_0.h,
                                          fc1_biases_0.c,
                                          STATIC_EXPONENT);

	dl_matrix3dqq_fc_with_bias(output_matrix3dq,
                                input_matrix3dq,
                                filter_matrix3dq,
                                bias_matrix3dq,
                                DL_XTENSA_IMPL,
                                debug_mode);

	dl_matrix3dq_free(input_matrix3dq);
	dl_matrix3dq_free(filter_matrix3dq);
	dl_matrix3dq_free(bias_matrix3dq);
    
    debug_logi("FUlly", output_matrix3dq);

    // result
    max_value = output_matrix3dq->item[0];
    ans_index = 0;
	for(int find_result=1; find_result < fc1_biases_0.c; find_result++){
		int vlaue = *(output_matrix3dq->item + find_result);
        if(vlaue > max_value){
			max_value = vlaue;
			ans_index = find_result;
		}
	}

    ESP_LOGI("DSCNN RESULT","TEST INPUT: %s RESULT: %s", class_label[input_test], class_label[ans_index]);
    // if(debug_mode == __TEST_ON__){
    //     ESP_LOGI("DSCNN RESULT","TEST INPUT: %2d RESULT: %2d", input_test, ans_index);
    // }

	dl_matrix3dq_free(output_matrix3dq);

    // if(ans_index >= 8)
    //     ans_index++;

    // ESP_LOGI("HOW LONG", "%lld us", esp_timer_get_time() - timer);

    return ans_index;
}

void debug_logi(char *layer, dl_matrix3dq_t *check_matrix3dq){
    if(debug_mode == __TEST_ON__){
        ESP_LOGI("DSCNN_SET", "%15s %3d %3d %3d %3d %3d",
            layer,
            check_matrix3dq->w,
            check_matrix3dq->h,
            check_matrix3dq->c,
            check_matrix3dq->n,
            check_matrix3dq->exponent);

        int p = 0;
        char logiout[1024];
        
        memset(logiout, 0, sizeof(char) * 1024);

        for (int h = 0; h < check_matrix3dq->h; h++) {
            memset(logiout, 0, sizeof(char) * 1024);
            sprintf(logiout, "%3d %15s ", h, layer);
            for (int w = 0; w < check_matrix3dq->w; w++) {
                sprintf(logiout, "%s %6d ", logiout, *(check_matrix3dq->item + p + (w * check_matrix3dq->c)));
            }
            p += (check_matrix3dq->w * check_matrix3dq->c);
            ESP_LOGI("DSCNN", "%s", logiout);
        }
    }
}

int stride_reshaper(int size, int wh, int striding){
    return ceil((double)size/(double)dscnn_model_info[striding][wh]);
}
